zephyrproject-rtos/hal_silabs/simplicity_sdk/platform/Device/SiliconLabs/EFR32BG29/Include/efr32bg29_lfxo.h
/* Bit fields for LFXO IEN */
#define _LFXO_IEN_RESETVALUE                 0x00000000UL                               /**< Default value for LFXO_IEN                  */
#define _LFXO_IEN_MASK                       0x0000000FUL                               /**< Mask for LFXO_IEN                           */
#define LFXO_IEN_RDY                         (0x1UL << 0)                               /**< LFXO Ready Interrupt Enable                 */
#define _LFXO_IEN_RDY_SHIFT                  0                                          /**< Shift value for LFXO_RDY                    */
#define _LFXO_IEN_RDY_MASK                   0x1UL                                      /**< Bit mask for LFXO_RDY                       */
#define _LFXO_IEN_RDY_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for LFXO_IEN                   */
#define LFXO_IEN_RDY_DEFAULT                 (_LFXO_IEN_RDY_DEFAULT << 0)               /**< Shifted mode DEFAULT for LFXO_IEN           */
#define LFXO_IEN_POSEDGE                     (0x1UL << 1)                               /**< Rising Edge Interrupt Enable                */
#define _LFXO_IEN_POSEDGE_SHIFT              1                                          /**< Shift value for LFXO_POSEDGE                */
#define _LFXO_IEN_POSEDGE_MASK               0x2UL                                      /**< Bit mask for LFXO_POSEDGE                   */
#define _LFXO_IEN_POSEDGE_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for LFXO_IEN                   */
#define LFXO_IEN_POSEDGE_DEFAULT             (_LFXO_IEN_POSEDGE_DEFAULT << 1)           /**< Shifted mode DEFAULT for LFXO_IEN           */
#define LFXO_IEN_NEGEDGE                     (0x1UL << 2)                               /**< Falling Edge Interrupt Enable               */
#define _LFXO_IEN_NEGEDGE_SHIFT              2                                          /**< Shift value for LFXO_NEGEDGE                */
#define _LFXO_IEN_NEGEDGE_MASK               0x4UL                                      /**< Bit mask for LFXO_NEGEDGE                   */
#define _LFXO_IEN_NEGEDGE_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for LFXO_IEN                   */
#define LFXO_IEN_NEGEDGE_DEFAULT             (_LFXO_IEN_NEGEDGE_DEFAULT << 2)           /**< Shifted mode DEFAULT for LFXO_IEN           */
#define LFXO_IEN_FAIL                        (0x1UL << 3)                               /**< LFXO Failure Interrupt Enable               */
#define _LFXO_IEN_FAIL_SHIFT                 3                                          /**< Shift value for LFXO_FAIL                   */
#define _LFXO_IEN_FAIL_MASK                  0x8UL                                      /**< Bit mask for LFXO_FAIL                      */
#define _LFXO_IEN_FAIL_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for LFXO_IEN                   */
#define LFXO_IEN_FAIL_DEFAULT                (_LFXO_IEN_FAIL_DEFAULT << 3)              /**< Shifted mode DEFAULT for LFXO_IEN           */

/* Bit fields for LFXO SYNCBUSY */
#define _LFXO_SYNCBUSY_RESETVALUE            0x00000000UL                               /**< Default value for LFXO_SYNCBUSY             */
#define _LFXO_SYNCBUSY_MASK                  0x00000001UL                               /**< Mask for LFXO_SYNCBUSY                      */
#define LFXO_SYNCBUSY_CAL                    (0x1UL << 0)                               /**< LFXO Synchronization status                 */
#define _LFXO_SYNCBUSY_CAL_SHIFT             0                                          /**< Shift value for LFXO_CAL                    */
#define _LFXO_SYNCBUSY_CAL_MASK              0x1UL                                      /**< Bit mask for LFXO_CAL                       */
#define _LFXO_SYNCBUSY_CAL_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for LFXO_SYNCBUSY              */
#define LFXO_SYNCBUSY_CAL_DEFAULT            (_LFXO_SYNCBUSY_CAL_DEFAULT << 0)          /**< Shifted mode DEFAULT for LFXO_SYNCBUSY      */

/* Bit fields for LFXO LOCK */
#define _LFXO_LOCK_RESETVALUE                0x00001A20UL                               /**< Default value for LFXO_LOCK                 */
#define _LFXO_LOCK_MASK                      0x0000FFFFUL                               /**< Mask for LFXO_LOCK                          */
#define _LFXO_LOCK_LOCKKEY_SHIFT             0                                          /**< Shift value for LFXO_LOCKKEY                */
#define _LFXO_LOCK_LOCKKEY_MASK              0xFFFFUL                                   /**< Bit mask for LFXO_LOCKKEY                   */
#define _LFXO_LOCK_LOCKKEY_DEFAULT           0x00001A20UL                               /**< Mode DEFAULT for LFXO_LOCK                  */
#define _LFXO_LOCK_LOCKKEY_UNLOCK            0x00001A20UL                               /**< Mode UNLOCK for LFXO_LOCK                   */
#define LFXO_LOCK_LOCKKEY_DEFAULT            (_LFXO_LOCK_LOCKKEY_DEFAULT << 0)          /**< Shifted mode DEFAULT for LFXO_LOCK          */
#define LFXO_LOCK_LOCKKEY_UNLOCK             (_LFXO_LOCK_LOCKKEY_UNLOCK << 0)           /**< Shifted mode UNLOCK for LFXO_LOCK           */

/** @} End of group EFR32BG29_LFXO_BitFields */
/** @} End of group EFR32BG29_LFXO */
/** @} End of group Parts */

#endif // EFR32BG29_LFXO_H
